# # hello world 123423
# # name = 123
# # str - строки
# #
# a = "hello world"
# #
# print (a)
# #
# int - целочисленный тип
# # b = 1234
# #type - тип данных проверка
# # print (type(b), b)
# #float - число с плавающей точкой
# #a = .1
# # print (type(a) ,a)
# #bool - логический тип данных
# # a = True #False
# # print (type(a), a)
# # ctrl /
# #list - список,
# #набор элементов не связанных по типу
# # a = [1,2,
# "hello", True, 9,31
# # a = [1,2,3,4,5,6,7,81
# # print(a [0]) #1
# #tuple - набор неизмяимых элементов
# # a = (1,2)
# # print (type(a), a)
# #set - набор уникальных элементов
# #a = {1,2,3, 4,5,5,5}
# # print (a[0])
# #dict - словарь
# # a = {"key": "value"
# , "key1": "value1"}
# # print (a ["key"])
# # type()
# #
# id - код памяти
# # - присваивание
# #
# a
# = 10
# #
# b
# =
# a
# #
# b
# =
# 20
# #
# a
# 20
# #
# a
# = 40
# # b = 20
# # print(a + b)
# #a = [1,2]+[3]
# # print(a)
# #
# print ( [1,2]+[3])
# #
# print(a * b)
# #
# print( [0] * 10)
# # print("hello" * 10)
# # print(a / b)
# #
# print(a - b)
# #возведение в степень
# # print(a ** b)
# # а = 10 ** 0.5
# #цулочисленное
# деление
# # print(a // b)
# #остаток от деления
# # print(a % b)
# #><== !=<=>=
# операции сравнивают
# # 2 одинаковых типа данных
# #True/False
# # print (10 < 10, 10 < 10)
# # or and not #всегда True/False